x=[225,13,50,1002,133,99]
x=sorted(x) #昇順
print(x)

x=[225,13,50,1002,133,99]
x=sorted(x,reverse=True) #降順
print(x)

x=[225,13,50,1002,133,99]
x=x[3:6] #リスト3~6を表示
print(x)

x=[225,13,50,1002,133,99]
x[3:6]=[10,10,10] #数値を置き換える
print(x)

x=[225,13,50,1002,133,99]+[777,888,999]
print(x) #リストの結合

x=[225,13,50,1002,133,99]
x=len(x)  #要素素数を取得
print(x)

x=[225,13,50,1002,133,99,777,888,999]
x.insert(7,117) #挿入
print(x)

x=[225,13,50,1002,133,99,777,117,888,999]
x.remove(117) #117を削除
print(x)

x=[225,13,50,1002,133,99,777,888,999]
x.clear() #リストを空にする
print(x)

x=[225,13,50,1002,133,99,777,888,999]
del x   #リストそのものを削除

